<div style="text-align:center; background-color:#000080; padding:10px; border-radius:5px;">
    <h2 style="color:#FFF;">KPMG Virtual Internship - Data Analytics - Task 1</h2>
</div>

In the first task, our goal is to check and review the data quality in the given sheets of raw data from `Sprocket Central Pty Ltd`. It is important to ensure a good quality of data with no discrepancies to ensure quality data for next phase, i.e., analytics and inferencing insights.

In [1]:
import pandas as pd     # Import packages for laoding
import numpy as np

In [3]:
# There are datetime columns in pur raw data sheets, so we are using datetime to specify the column

transactions = pd.read_excel('KPMG_rawdata.xlsx', sheet_name='Transactions', 
                             dtype={'transaction_date': 'datetime64[ns]'})
new_customer_list = pd.read_excel('KPMG_rawdata.xlsx', sheet_name='NewCustomerList', 
                                  dtype={'DOB': 'datetime64[ns]'})
customer_demographic = pd.read_excel('KPMG_rawdata.xlsx', sheet_name='CustomerDemographic', 
                                     dtype={'DOB': 'datetime64[ns]'})
customer_address = pd.read_excel('KPMG_rawdata.xlsx', sheet_name='CustomerAddress')

Before joining all the above dataframes, we would check for the inaccuracies in each dataframe individually and document it further to email the client.

<div style="text-align:center; background-color:#ADD8E6; padding:10px; border-radius:5px;">
    <h2 style="color:#000;">Transactions Data Quality Check</h2>
</div>

In this section, we would deeply check and provide a quality review for `Transactions` data.

In [6]:
transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [12]:
(transactions.isna().sum()/len(transactions)*100).sort_values(ascending=False)

online_order               1.800
brand                      0.985
product_line               0.985
product_class              0.985
product_size               0.985
standard_cost              0.985
product_first_sold_date    0.985
transaction_id             0.000
product_id                 0.000
customer_id                0.000
transaction_date           0.000
order_status               0.000
list_price                 0.000
dtype: float64

In [9]:
transactions.duplicated().sum()

0

- There are no duplicate values in `transactions` data.
- But there are a small proportion of missing values in the columns such as `online_order`, `brand`, `product_line` etc.

We will look deeper into these missing values to make a suggestion. Let's go column-wise.

In [16]:
transactions[transactions['online_order'].isna()].head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
97,98,49,333,2017-06-23,NaN,Approved,Trek Bicycles,Road,medium,medium,533.51,400.13,37823.0
166,167,90,3177,2017-04-26,NaN,Approved,Norco Bicycles,Standard,low,medium,363.01,290.41,38482.0
169,170,6,404,2017-10-16,NaN,Approved,OHM Cycles,Standard,high,medium,227.88,136.73,37838.0
250,251,63,1967,2017-04-11,NaN,Approved,Solex,Standard,medium,medium,1483.20,99.59,42145.0
300,301,78,2530,2017-03-24,NaN,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,35455.0

In [22]:
transactions[transactions['online_order'].isna()]['transaction_date'].dt.month.value_counts()

11    41
2     34
3     32
8     32
7     31
1     31
4     28
10    28
6     27
5     26
12    25
9     25
Name: transaction_date, dtype: int64

In [23]:
transactions[transactions['online_order'].isna()]['product_class'].value_counts()

medium    239
high       61
low        58
Name: product_class, dtype: int64

In [21]:
transactions[transactions['online_order'].isna()]['product_size'].value_counts()

medium    223
large      76
small      59
Name: product_size, dtype: int64

- There seems to be no pattern in missing values in `online_order` regarding month of transaction.
- There are maximum missing values for `medium` product size and product class. We are assuming it might be due to some mechanical or human error.

-- Advised to look deeper into these `medium` sized online orders.

In [25]:
transactions[transactions['brand'].isna()].head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
136,137,0,431,2017-09-23,0.0,Approved,NaN,NaN,NaN,NaN,1942.61,NaN,NaN
159,160,0,3300,2017-08-27,0.0,Approved,NaN,NaN,NaN,NaN,1656.86,NaN,NaN
366,367,0,1614,2017-03-10,0.0,Approved,NaN,NaN,NaN,NaN,850.89,NaN,NaN
406,407,0,2559,2017-06-14,1.0,Approved,NaN,NaN,NaN,NaN,710.59,NaN,NaN
676,677,0,2609,2017-07-02,0.0,Approved,NaN,NaN,NaN,NaN,1972.01,NaN,NaN

In [30]:
transactions[transactions['brand'].isna()]['product_id'].value_counts()

0    197
Name: product_id, dtype: int64

- Records where there is missing value in `brand` column correspondingly has missing values in `product_line`, `product_class`, `product_size`, `standard_cost` and `product_first_sold_date` columns.
- Surprisingly these all records have same `product_id`, i.e., `0`

-- Hence, it is suggested to look more into why products belonging to this particular product ID has missing values in `brand`, `product_line`, `product_class`, `product_size`, `standard_cost` and `product_first_sold_date` columns.

<div style="text-align:center; background-color:#B4E57C; padding:10px; border-radius:5px;">
    <h2 style="color:#000;">New Customer List Data Quality Check</h2>
</div>

In this section, let us look for possible presence of data discrepancies and inaccuracies in `New Customers List`.

In [38]:
new_customer_list.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.94,1.175,1.46875,1.248437,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.83,0.830,1.03750,0.881875,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,1.05,1.050,1.05000,1.050000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.98,1.225,1.22500,1.225000,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.68,0.680,0.85000,0.850000,4,4,1.703125

In [43]:
(new_customer_list.isna().sum()/len(new_customer_list)*100).sort_values(ascending=False)[:5]

job_industry_category    16.5
job_title                10.6
last_name                 2.9
DOB                       1.7
first_name                0.0
dtype: float64

In [45]:
new_customer_list.duplicated().sum()

0

- `job_industry_category` has maximum number of missing values followed by `job_title`, `last_name` and `DOB`.
- Fortunately, there are no duplicate values in the dataframe.

In [47]:
new_customer_list.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

- Looking at column names (as there are 23 columns), there are columns with names and values which indicate some quantity but have not been named appropriately.
- These columns are `Unnamed: 16`, `Unnamed: 17`, `Unnamed: 18`, `Unnamed: 19`, `Unnamed: 20`, `Rank` and `Value`.
- Also, `Unnamed: 20` and `Rank` column are indicating to same value.
- Unit of measurement has not been specified in `property_valuation` column.

Let us look deeper into columns with appropriate names and values.

In [59]:
new_customer_list[new_customer_list['last_name'].isna()].head(2)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
12,Olag,NaN,Male,60,1990-05-13,Human Resources Manager,Telecommunications,Mass Customer,N,No,...,NSW,Australia,11,0.55,0.550,0.6875,0.584375,13,13,1.609375
58,Whittaker,NaN,Male,64,1966-07-29,Media Manager III,NaN,Mass Customer,N,Yes,...,VIC,Australia,5,0.78,0.975,0.9750,0.828750,57,57,1.375000

- Ask `last_names` of these particular customers and get rid of missing values in this column.

In [65]:
print(new_customer_list['DOB'].max(), new_customer_list['DOB'].min())

2002-02-27 00:00:00 1938-06-08 00:00:00

In [67]:
new_customer_list[new_customer_list['DOB'].isna()].head(2)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
59,Normy,Goodinge,U,5,NaT,Associate Professor,IT,Mass Customer,N,No,...,VIC,Australia,5,0.85,0.850,0.85000,0.72250,57,57,1.3750
226,Hatti,Carletti,U,35,NaT,Legal Assistant,IT,Affluent Customer,N,Yes,...,NSW,Australia,9,0.50,0.625,0.78125,0.78125,226,226,1.1125

- Customer with `U` (or Unidentified) gender seem to be the ones with missing data on `DOB` (Date of Birth).
- This may be due to these customers unwilling to identify their gender.

-- It is suggested to contact these customers with `U` (Unidentified) gender and ask for their `DOB` details.

In [76]:
new_customer_list[new_customer_list['job_title'].isna()].head(2)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
15,Dukie,Swire,Male,88,1954-03-31,NaN,Manufacturing,Affluent Customer,N,Yes,...,NSW,Australia,8,1.08,1.35,1.6875,1.6875,16,16,1.56250
25,Rourke,Gillbard,Male,11,1945-08-03,NaN,Property,Mass Customer,N,No,...,QLD,Australia,4,0.55,0.55,0.5500,0.4675,26,26,1.46875

- Contact these customers for their `job_title`s and fill the missing information.

In [83]:
new_customer_list[new_customer_list['job_industry_category'].isna()].head(2)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
22,Otis,Ottey,Male,26,1998-02-05,Quality Engineer,NaN,Mass Customer,N,No,...,QLD,Australia,4,0.99,0.9900,0.9900,0.8415,23,23,1.5
23,Tabbatha,Averill,Female,5,1977-12-17,Quality Control Specialist,NaN,Affluent Customer,N,Yes,...,NSW,Australia,8,0.89,1.1125,1.1125,1.1125,23,23,1.5

-- Ask these customers to also give information of their job industry.

<div style="text-align:center; background-color:#D3D3D3; padding:10px; border-radius:5px;">
    <h2 style="color:#000;">Customer Demographics Data Quality Check</h2>
</div>

In this section, let us look for possible presence of data discrepancies and inaccuracies in `Customer Demographics` column.

In [85]:
customer_demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [89]:
(customer_demographic.isna().sum()/len(customer_demographic)*100).sort_values(ascending=False)

job_industry_category                  16.400
job_title                              12.650
default                                 7.550
last_name                               3.125
DOB                                     2.175
tenure                                  2.175
customer_id                             0.000
first_name                              0.000
gender                                  0.000
past_3_years_bike_related_purchases     0.000
wealth_segment                          0.000
deceased_indicator                      0.000
owns_car                                0.000
dtype: float64

In [90]:
customer_demographic.duplicated().sum()

0

- Missing values in `job_industry_category`, `job_title`, `default`, `last_name`, `DOB` and `tenure` columns.
- There are no duplicated values in this dataframe.

Let us look into each column individually.

In [95]:
customer_demographic[customer_demographic['job_title'].isna()]
customer_demographic[customer_demographic['job_industry_category'].isna()].head(2)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0
7,8,Rod,Inder,Male,31,1962-03-30,Media Manager I,NaN,Mass Customer,N,(â¯Â°â¡Â°ï¼â¯ï¸µ â»ââ»),No,7.0

- Fill the missing values of `last_name`, `job_title` and `job_industry_category` by contacting customers with these missing information.
- Drop `default` column as it has values which make no sense or add any value to our data.

In [97]:
customer_demographic[customer_demographic['DOB'].isna()]['gender'].value_counts()

U    87
Name: gender, dtype: int64

In [105]:
customer_demographic[customer_demographic['tenure'].isna()]['gender'].value_counts()

U    87
Name: gender, dtype: int64

In [101]:
print(f"Max DOB value: {customer_demographic['DOB'].max()}, Min DOB value: {customer_demographic['DOB'].min()}")

Max DOB value: 2002-03-11 00:00:00, Min DOB value: 1843-12-21 00:00:00

- All the customers with missing `DOB` and `tenure` values are from `U` (Unidentified) gender for some reason, it is suggested to contact these customers for their birth date information.
- Smallest `DOB` value does not make sense as the age of the customer is 180 years according to it. So, DOB of this customer needs to reconfirmed.
- Mention the unit of `tenure` column and specify whether it is year or month.

<div style="text-align:center; background-color:#D2B48C; padding:10px; border-radius:5px;">
    <h2 style="color:#000;">Customer Address Data Quality Check</h2>
</div>

In this section, let us look for possible presence of data discrepancies and inaccuracies in `Customer Address` column.

In [106]:
customer_address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [107]:
customer_address.isna().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [108]:
customer_address.duplicated().sum()

0

- No missing values and duplicate values in this dataframe.

- Only suggestion is to mention unit of currency (million, billion or other) of `property_valuation`.

Apart from this everything seems fine for this dataframe.